espressif/esp-idf/components/soc/esp32h21/register/soc/rmt_reg.h
/** RMT_CH2CONF1_REG register
 *  Channel 2 configure register 1
 */
#define RMT_CH2CONF1_REG (DR_REG_RMT_BASE + 0x1c)
/** RMT_RX_EN_CH2 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable receiver to receive data on CHANNEL2.
 */
#define RMT_RX_EN_CH2    (BIT(0))
#define RMT_RX_EN_CH2_M  (RMT_RX_EN_CH2_V << RMT_RX_EN_CH2_S)
#define RMT_RX_EN_CH2_V  0x00000001U
#define RMT_RX_EN_CH2_S  0
/** RMT_MEM_WR_RST_CH2 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset write ram address for CHANNEL2 by accessing receiver.
 */
#define RMT_MEM_WR_RST_CH2    (BIT(1))
#define RMT_MEM_WR_RST_CH2_M  (RMT_MEM_WR_RST_CH2_V << RMT_MEM_WR_RST_CH2_S)
#define RMT_MEM_WR_RST_CH2_V  0x00000001U
#define RMT_MEM_WR_RST_CH2_S  1
/** RMT_APB_MEM_RST_CH2 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL2 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_CH2    (BIT(2))
#define RMT_APB_MEM_RST_CH2_M  (RMT_APB_MEM_RST_CH2_V << RMT_APB_MEM_RST_CH2_S)
#define RMT_APB_MEM_RST_CH2_V  0x00000001U
#define RMT_APB_MEM_RST_CH2_S  2
/** RMT_MEM_OWNER_CH2 : R/W/SC; bitpos: [3]; default: 1;
 *  This register marks the ownership of CHANNEL2's ram block.
 *
 *  1'h1: Receiver is using the ram.
 *
 *  1'h0: APB bus is using the ram.
 */
#define RMT_MEM_OWNER_CH2    (BIT(3))
#define RMT_MEM_OWNER_CH2_M  (RMT_MEM_OWNER_CH2_V << RMT_MEM_OWNER_CH2_S)
#define RMT_MEM_OWNER_CH2_V  0x00000001U
#define RMT_MEM_OWNER_CH2_S  3
/** RMT_RX_FILTER_EN_CH2 : R/W; bitpos: [4]; default: 0;
 *  This is the receive filter's enable bit for CHANNEL2.
 */
#define RMT_RX_FILTER_EN_CH2    (BIT(4))
#define RMT_RX_FILTER_EN_CH2_M  (RMT_RX_FILTER_EN_CH2_V << RMT_RX_FILTER_EN_CH2_S)
#define RMT_RX_FILTER_EN_CH2_V  0x00000001U
#define RMT_RX_FILTER_EN_CH2_S  4
/** RMT_RX_FILTER_THRES_CH2 : R/W; bitpos: [12:5]; default: 15;
 *  Ignores the input pulse when its width is smaller than this register value in APB
 *  clock periods (in receive mode).
 */
#define RMT_RX_FILTER_THRES_CH2    0x000000FFU
#define RMT_RX_FILTER_THRES_CH2_M  (RMT_RX_FILTER_THRES_CH2_V << RMT_RX_FILTER_THRES_CH2_S)
#define RMT_RX_FILTER_THRES_CH2_V  0x000000FFU
#define RMT_RX_FILTER_THRES_CH2_S  5
/** RMT_MEM_RX_WRAP_EN_CH2 : R/W; bitpos: [13]; default: 0;
 *  This is the channel 2 enable bit for wraparound mode: it will resume receiving at
 *  the start when the data to be received is more than its memory size.
 */
#define RMT_MEM_RX_WRAP_EN_CH2    (BIT(13))
#define RMT_MEM_RX_WRAP_EN_CH2_M  (RMT_MEM_RX_WRAP_EN_CH2_V << RMT_MEM_RX_WRAP_EN_CH2_S)
#define RMT_MEM_RX_WRAP_EN_CH2_V  0x00000001U
#define RMT_MEM_RX_WRAP_EN_CH2_S  13
/** RMT_CONF_UPDATE_CH2 : WT; bitpos: [15]; default: 0;
 *  synchronization bit for CHANNEL2
 */
#define RMT_CONF_UPDATE_CH2    (BIT(15))
#define RMT_CONF_UPDATE_CH2_M  (RMT_CONF_UPDATE_CH2_V << RMT_CONF_UPDATE_CH2_S)
#define RMT_CONF_UPDATE_CH2_V  0x00000001U
#define RMT_CONF_UPDATE_CH2_S  15

/** RMT_CH3CONF0_REG register
 *  Channel 3 configure register 0
 */
#define RMT_CH3CONF0_REG (DR_REG_RMT_BASE + 0x20)
/** RMT_DIV_CNT_CH3 : R/W; bitpos: [7:0]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL3.
 */
#define RMT_DIV_CNT_CH3    0x000000FFU
#define RMT_DIV_CNT_CH3_M  (RMT_DIV_CNT_CH3_V << RMT_DIV_CNT_CH3_S)
#define RMT_DIV_CNT_CH3_V  0x000000FFU
#define RMT_DIV_CNT_CH3_S  0
/** RMT_IDLE_THRES_CH3 : R/W; bitpos: [22:8]; default: 32767;
 *  When no edge is detected on the input signal and continuous clock cycles is longer
 *  than this register value, received process is finished.
 */
#define RMT_IDLE_THRES_CH3    0x00007FFFU
#define RMT_IDLE_THRES_CH3_M  (RMT_IDLE_THRES_CH3_V << RMT_IDLE_THRES_CH3_S)
#define RMT_IDLE_THRES_CH3_V  0x00007FFFU
#define RMT_IDLE_THRES_CH3_S  8
/** RMT_MEM_SIZE_CH3 : R/W; bitpos: [25:23]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL3.
 */
#define RMT_MEM_SIZE_CH3    0x00000007U
#define RMT_MEM_SIZE_CH3_M  (RMT_MEM_SIZE_CH3_V << RMT_MEM_SIZE_CH3_S)
#define RMT_MEM_SIZE_CH3_V  0x00000007U
#define RMT_MEM_SIZE_CH3_S  23
/** RMT_CARRIER_EN_CH3 : R/W; bitpos: [28]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL3. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_CH3    (BIT(28))
#define RMT_CARRIER_EN_CH3_M  (RMT_CARRIER_EN_CH3_V << RMT_CARRIER_EN_CH3_S)
#define RMT_CARRIER_EN_CH3_V  0x00000001U
#define RMT_CARRIER_EN_CH3_S  28
/** RMT_CARRIER_OUT_LV_CH3 : R/W; bitpos: [29]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL3.
 *
 *  1'h0: add carrier wave on low level.
 *
 *  1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_CH3    (BIT(29))
#define RMT_CARRIER_OUT_LV_CH3_M  (RMT_CARRIER_OUT_LV_CH3_V << RMT_CARRIER_OUT_LV_CH3_S)
#define RMT_CARRIER_OUT_LV_CH3_V  0x00000001U
#define RMT_CARRIER_OUT_LV_CH3_S  29

/** RMT_CH3CONF1_REG register
 *  Channel 3 configure register 1
 */
#define RMT_CH3CONF1_REG (DR_REG_RMT_BASE + 0x24)
/** RMT_RX_EN_CH3 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable receiver to receive data on CHANNEL3.
 */
#define RMT_RX_EN_CH3    (BIT(0))
#define RMT_RX_EN_CH3_M  (RMT_RX_EN_CH3_V << RMT_RX_EN_CH3_S)
#define RMT_RX_EN_CH3_V  0x00000001U
#define RMT_RX_EN_CH3_S  0
/** RMT_MEM_WR_RST_CH3 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset write ram address for CHANNEL3 by accessing receiver.
 */
#define RMT_MEM_WR_RST_CH3    (BIT(1))
#define RMT_MEM_WR_RST_CH3_M  (RMT_MEM_WR_RST_CH3_V << RMT_MEM_WR_RST_CH3_S)
#define RMT_MEM_WR_RST_CH3_V  0x00000001U
#define RMT_MEM_WR_RST_CH3_S  1
/** RMT_APB_MEM_RST_CH3 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL3 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_CH3    (BIT(2))
#define RMT_APB_MEM_RST_CH3_M  (RMT_APB_MEM_RST_CH3_V << RMT_APB_MEM_RST_CH3_S)
#define RMT_APB_MEM_RST_CH3_V  0x00000001U
#define RMT_APB_MEM_RST_CH3_S  2
/** RMT_MEM_OWNER_CH3 : R/W/SC; bitpos: [3]; default: 1;
 *  This register marks the ownership of CHANNEL3's ram block.
 *
 *  1'h1: Receiver is using the ram.
 *
 *  1'h0: APB bus is using the ram.
 */
#define RMT_MEM_OWNER_CH3    (BIT(3))
#define RMT_MEM_OWNER_CH3_M  (RMT_MEM_OWNER_CH3_V << RMT_MEM_OWNER_CH3_S)
#define RMT_MEM_OWNER_CH3_V  0x00000001U
#define RMT_MEM_OWNER_CH3_S  3
/** RMT_RX_FILTER_EN_CH3 : R/W; bitpos: [4]; default: 0;
 *  This is the receive filter's enable bit for CHANNEL3.
 */
#define RMT_RX_FILTER_EN_CH3    (BIT(4))
#define RMT_RX_FILTER_EN_CH3_M  (RMT_RX_FILTER_EN_CH3_V << RMT_RX_FILTER_EN_CH3_S)
#define RMT_RX_FILTER_EN_CH3_V  0x00000001U
#define RMT_RX_FILTER_EN_CH3_S  4
/** RMT_RX_FILTER_THRES_CH3 : R/W; bitpos: [12:5]; default: 15;
 *  Ignores the input pulse when its width is smaller than this register value in APB
 *  clock periods (in receive mode).
 */
#define RMT_RX_FILTER_THRES_CH3    0x000000FFU
#define RMT_RX_FILTER_THRES_CH3_M  (RMT_RX_FILTER_THRES_CH3_V << RMT_RX_FILTER_THRES_CH3_S)
#define RMT_RX_FILTER_THRES_CH3_V  0x000000FFU
#define RMT_RX_FILTER_THRES_CH3_S  5
/** RMT_MEM_RX_WRAP_EN_CH3 : R/W; bitpos: [13]; default: 0;
 *  This is the channel 3 enable bit for wraparound mode: it will resume receiving at
 *  the start when the data to be received is more than its memory size.
 */
#define RMT_MEM_RX_WRAP_EN_CH3    (BIT(13))
#define RMT_MEM_RX_WRAP_EN_CH3_M  (RMT_MEM_RX_WRAP_EN_CH3_V << RMT_MEM_RX_WRAP_EN_CH3_S)
#define RMT_MEM_RX_WRAP_EN_CH3_V  0x00000001U
#define RMT_MEM_RX_WRAP_EN_CH3_S  13
/** RMT_CONF_UPDATE_CH3 : WT; bitpos: [15]; default: 0;
 *  synchronization bit for CHANNEL3
 */
#define RMT_CONF_UPDATE_CH3    (BIT(15))
#define RMT_CONF_UPDATE_CH3_M  (RMT_CONF_UPDATE_CH3_V << RMT_CONF_UPDATE_CH3_S)
#define RMT_CONF_UPDATE_CH3_V  0x00000001U
#define RMT_CONF_UPDATE_CH3_S  15

